fonte: https://minerandodados.com.br/trabalhando-com-banco-de-dados-sql-usando-python/

In [1]:
import pandas as pd
import sqlalchemy

In [2]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [8]:
engine = sqlalchemy.create_engine('mysql+pymysql://gama:gama@127.0.0.1:3306/formula1')

In [10]:
df = pd.read_sql_table('construtores',engine)

In [11]:
df.head()

   id_construtor nome_construtor nacionalidade_construtor
0              1         McLaren                  British
1              2      BMW Sauber                   German
2              3        Williams                  British
3              4         Renault                   French
4              5      Toro Rosso                  Italian

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211 entries, 0 to 210
Data columns (total 3 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   id_construtor             211 non-null    int64
 1   nome_construtor           211 non-null    object
 2   nacionalidade_construtor  211 non-null    object
dtypes: int64(1), object(2)
memory usage: 5.1+ KB

In [14]:
df2 = pd.read_sql_query("select * from construtores where nome_construtor = 'McLaren'",engine)
df2.head()

   id_construtor nome_construtor nacionalidade_construtor
0              1         McLaren                  British

In [ ]:
query = '''
SELECT  emp.first_name,
        emp.last_name,
        emp.gender,
        depar.dept_name as departament_name,
        dept.from_date,
        dept.to_date
FROM employees emp
INNER JOIN dept_emp dept
ON emp.emp_no = dept.emp_no
INNER JOIN departments depar
ON dept.dept_no = depar.dept_no;
'''

df = pd.read_sql_query(query,engine)
df.head()

In [17]:
# Criando um DataFrame a partir de uma query utilizando parâmetros dinâmicos.

query = 'SELECT *' \
      'FROM construtores ' \
      'WHERE nome_construtor = %s'
df3 = pd.read_sql_query(query, engine,params=[input('digite um construtor')])
df3.head()

digite um construtorMcLaren

   id_construtor nome_construtor nacionalidade_construtor
0              1         McLaren                  British

In [18]:
df4 = pd.read_sql_query("select * from TB_PAIS",engine)
df4.head()

   ID_PAIS    NOME_PAIS
0        1  Afghanistan
1        2      Albania
2        3      Algeria
3        4      Andorra
4        5       Angola